//=========================================================================
//**   Web引擎服务产品中间件（CeriumX.WebEngine）
//=========================================================================
//**   脉脉含情的充满精神的高尚的小强精神
//**   风幽思静繁花落；夜半楼台听江雨。（cockroach888@outlook.com）
//=========================================================================
//**   Copyright © 蟑螂·魂 2022 -- Support 华夏银河空间联盟
//=========================================================================
// 文件名称：WebDefinitions.cs
// 项目名称：Web引擎服务产品中间件
// 创建时间：2022-10-13 13:35:56
// 创建人员：宋杰军
// 电子邮件：cockroach888@outlook.com
// 负责人员：宋杰军
// 参与人员：宋杰军
// ========================================================================
// 修改日期：
// 修改人员：
// 修改内容：
// ========================================================================
namespace CeriumX.WebEngine.Abstractions;

/// <summary>
/// 虚拟主机资源访问级别枚举列表
/// </summary>
public enum VirtualResourceAccessKind
{
    /// <summary>
    /// 拒绝所有跨源的资源访问，包括作为脚本或图像元素的src的正常子资源访问。
    /// </summary>
    Deny,

    /// <summary>
    /// 允许所有的跨源资源访问，包括接受跨源资源共享（CORS）检查的访问。
    /// </summary>
    /// <remarks>该行为类似于网站发回http头Access-Control-Allow-Origin。*.</remarks>
    Allow,

    /// <summary>
    /// 对于正常的子资源访问，如脚本或图像元素的src，允许跨源资源访问，而任何受CORS检查的访问都将被拒绝。
    /// </summary>
    DenyCors
}

/// <summary>
/// 浏览器捕捉图像格式枚举列表
/// </summary>
public enum CapturePreviewImageFormat
{
    /// <summary>
    /// 表示使用PNG图像格式
    /// </summary>
    Png,

    /// <summary>
    /// 表示使用JPEG图像格式
    /// </summary>
    Jpeg
}